{
  "content": [
    {
      "id": "4",
      "name": "Toys",
      "title": "toys title",
      "path": "toys",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Perfect toys for your dog's playtime enjoyment\n\nDogs are more than just pets; they are loyal companions and beloved members of our families. One of the best ways to show our furry friends love and care is through playtime. Dog toys are not just playthings; they're essential tools for keeping your dog mentally and physically stimulated. When choosing dog toys, always prioritize safety. Opt for toys made from non-toxic materials and avoid small parts that your dog could swallow. Supervise playtime, especially with new toys, to ensure your dog's safety.\n### Types of Dog Toys\n\n#### Fetch Toys\n\nPlaying with your dog strengthens the bond between you and your furry friend. Balls, frisbees, and sticks are perfect for a game of fetch. They encourage your dog to run and exercise, and the joy of retrieving brings a sense of accomplishment.\n\n#### Chew Toys\n\nRegular brushing and combing are essential for maintaining a healthy coat and reducing shedding. Our selection of brushes and combs is designed to cater to different coat types. From slicker brushes for long-haired breeds to deshedding tools for heavy shedders, we have the right grooming tools for you.\n\n#### Squeaky Toys\n\nSqueaky toys mimic the sound of prey, making them particularly exciting for many dogs. These toys emit playful squeaks when bitten or squeezed, providing entertainment and engagement during playtime.\n\n#### Plush Toys\n\nSoft and cuddly plush toys are great for comfort and companionship. Plush toys provide comfort and companionship to dogs of all ages. They are soft and cuddly, making them perfect for dogs that enjoy snuggling with a plush friend. Look for plush toys with reinforced seams for added durability. Keep in mind that some dogs may enjoy gently chewing on their plush toys, while others prefer to treat them as comfort objects using them as pillows during naptime.",
      "productCount": 13
    },
    {
      "id": "7",
      "name": "Leads&harnesses",
      "title": "leads title",
      "path": "leads&harnesses",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Make an Informed Choice about Right Dog Leash\n\nWhen it comes to walking your four-legged friend, selecting the right dog leash is crucial. The choice of leash can greatly impact both your and your dog's comfort, safety, and overall walking experience. In this guide, we'll delve into the different types of dog leashes to help you make an informed decision. Each type of dog leash has its own advantages and disadvantages. The key is to consider your dog's size, temperament, and your preferred walking environment when making your selection. Whichever leash you choose, always prioritize safety and ensure a secure connection between you and your beloved pet.\n\n#### Standard Dog Leash\n\nThe standard dog leash is the classic choice for many dog owners. It's typically made from nylon or leather and comes in various lengths, with 4 to 6 feet being the most common. Standard leashes offer excellent control, making them ideal for training and walking in crowded areas. They provide a solid connection between you and your four-legged friend.\n\n#### Retractable Dog Leash\n\nRetractable leashes are all about giving your dog more freedom to roam while maintaining control. They feature a retractable cord or tape that can extend and retract as your dog moves. This type is perfect for allowing your dog to explore a bit during walks, but they require responsible handling to prevent tangling and accidents.\n\n#### Adjustable-length Leash\n\nAn adjustable-length leash offers versatility by allowing you to change the length as needed. It typically features multiple D-rings or clasps along its length, enabling you to customize the leash's size for various situations. This is an excellent choice for dogs that require both close control and some freedom during their walk.\n\n#### Martingale Leash\n\nMartingale leashes combine a standard leash with a limited-slip collar. They offer gentle control over your dog's movements without choking or causing discomfort. Martingale leashes are commonly used for dogs that have a tendency to slip out of regular collars.\n\n#### Hands-Free Leash\n\nActive dog owners love hands-free leashes that allow them to jog, hike, or walk their dogs without holding onto a traditional leash. These leashes are typically worn around the waist or across the body, leaving your hands free for other activities.\n\n#### Chain Leash\n\nChain leashes are exceptionally durable and are often used for strong, large breeds. They provide a sturdy grip and can withstand a lot of wear and tear. However, they can be heavier and less comfortable to hold than nylon or leather leashes.\n\n#### Bungee Leash\n\nBungee leashes have an elastic section that absorbs shock and reduces the impact of sudden pulls or jolts from your dog. They are perfect for dogs that tend to be enthusiastic pullers and help prevent injury to both you and your pup.",
      "productCount": 13
    },
    {
      "id": "6",
      "name": "Furniture",
      "title": "furniture title",
      "path": "furniture",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Elevate Your Dog's Comfort with Stylish Dog Furniture\n\nYour dog deserves the best, not only in love and care but also in comfort and style. That's why we've curated a selection of exquisite dog furniture pieces that will transform your home into a haven of luxury for your beloved canine companion. Create a space that reflects your style and provides your furry friend with a comfortable retreat. Browse our collection today and discover how you can elevate your dog's living experience.\n\n#### Luxury Dog Beds\n\nOur dog beds come in various sizes and styles, from plush and cushioned to elevated and orthopedic. Give your dog a luxurious place to rest, ensuring they wake up refreshed and rejuvenated.\n\n#### Cozy Crates and Kennels\n\nA cozy crate can be your dog's sanctuary, providing them with a safe and secure space they can call their own. Explore our stylish crates and kennels that blend seamlessly with your home decor while giving your dog a comfortable retreat. Our crates are available in various sizes to accommodate dogs of all breeds.\n\n#### Indoor and Outdoor Furniture\n\nGive your dog the comfort and luxury they deserve with our range of dog furniture. Create a space that reflects your style and provides your furry friend with a comfortable retreat. Browse our collection today and discover how you can elevate your dog's living experience.\n\n### Quality and Durability\n\nOur dog furniture is crafted with the utmost care and attention to detail. We prioritize quality and durability to ensure that your investment in your dog's comfort lasts for years to come. Rest assured that our furniture is built to withstand the wear and tear of daily use. Many of our dog furniture pieces come with additional features such as storage compartments, removable and washable covers, and built-in pet bowls, enhancing their functionality.",
      "productCount": 13
    },
    {
      "id": "3",
      "name": "Collars",
      "title": "collars title",
      "path": "collars",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Why Choose a Quality Dog Collar?\n\nYour dog's collar is not just an accessory; it's a vital tool for their safety and identification.  We understand that choosing the right collar is essential for your dog's well-being. That's why we offer a wide selection and comprehensive guidance to help you make an informed choice. Remember that your dog's collar it's a reflection of your love and care for your beloved pet.\n\n### Choosing the Perfect Dog Collar: Tips and Advice\n\n#### 1.Measure for Fit\n\nProper fit is crucial for your dog's comfort and safety. Measure your dog's neck circumference accurately to select the right size. Most collars come with sizing charts to assist you in choosing the appropriate size.\n\n#### 2.Consider Your Dog's Activity Level\n\nDifferent dogs have different activity levels. If your dog is highly IN STOCK, a durable, adjustable, and secure collar is essential. For dogs with sensitive skin or neck issues, consider padded or cushioned collars for added comfort.\n\n#### 3.Reflect on Safety Features\n\nSafety should be a top priority. Opt for collars with reflective or LED features if you walk your dog during low-light hours. These collars enhance visibility, ensuring your pet is seen by others, which is especially important near roads.\n\n#### 4.Material Matters\n\nCollars come in various materials, including nylon, leather, and chain. Each material has its own set of pros and cons. Nylon is lightweight and easy to clean, while leather is durable and stylish. Chain collars may be suitable for training purposes, but use them with caution and seek professional guidance if necessary.\n\n#### 5.Personalization Options\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n#### 6.Regular Checkups\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n### Shop with Confidence\n\nAt Happy Tails, we are committed to providing you with the best selection of dog collars from top brands that prioritize quality and safety. Browse our catalog, read product descriptions, and make an informed choice for your beloved pet.\nChoosing the right dog collar is an important decision for any pet owner. With our range of options and these valuable tips, you can find a collar that keeps your furry friend both safe and stylish. Shop now and give your dog the comfort and security they deserve",
      "productCount": 13
    },
    {
      "id": "5",
      "name": "Clothing",
      "title": "clothing title",
      "path": "clothing",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Stylish Dog Clothes from Top Brands\nWelcome to the ultimate destination for discerning dog owners and their fashionable companions. Happy tails comprehensive catalog features a curated selection of dog clothes from renowned brands that are committed to quality, style, and comfort. Whether you're seeking cozy sweaters for those chilly evenings, rugged outdoor gear for adventurous outings, or the latest fashion trends for your stylish pooch, our catalog has it all. We understand that dogs have unique needs, and that's why we offer a wide range of styles and sizes to cater to every breed and personality.\n\n### How to Choose the Perfect Dog Clothes: A Guide for Pet Parents\n\n#### Consider Your Dog's Size and Breed\n\nOne size does not fit all when it comes to dog clothing. Different breeds have varying body shapes and sizes. Measure your dog's neck, chest, and length to ensure a proper fit. Many brands provide sizing charts to help you choose the right size, so be sure to refer to these guides when shopping.\n\n#### Think About the Season\n\nJust like humans, dogs have different clothing needs depending on the weather. In colder months, opt for insulating and warm clothes like sweaters, coats, and booties to keep your pup cozy during outdoor adventures. In warmer weather, lightweight and breathable options like T-shirts and cooling vests can help your dog stay comfortable.\n\n#### Consider Your Dog's Activity Level\n\nIf your dog is an active one, choose clothes that allow for easy movement. Look for designs with adjustable closures and elastic bands that provide flexibility without compromising fit. For less active dogs or those recovering from surgery, consider garments that are easy to put on and take off.\n\n#### Prioritize Safety and Comfort\n\nEnsure that the clothes you choose don't have any small parts that your dog could chew on or swallow. Opt for materials that are soft, non-restrictive, and hypoallergenic to avoid irritation. Always check for any tags or seams that could cause discomfort.\n\n#### Style and Aesthetics\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n### Elevate Your Dog's Style\nChoosing dog clothes can be a fun and rewarding experience when you keep your pet's comfort and safety in mind. By following these guidelines, you can make sure your furry friend not only looks great but also feels great in their new attire. With our user-friendly online store, shopping for your furry friend has never been easier. Our secure checkout process and reliable shipping ensure that your dog's new outfits will be at your doorstep in no time.",
      "productCount": 13
    },
    {
      "id": "2",
      "name": "Care",
      "title": "care title",
      "path": "care",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Give your dog the royal treatment with our grooming essentials\n\n#### Shampoos and Conditioners\n\nOur range of dog shampoos and conditioners includes options for various coat types and specific needs. Whether your dog has sensitive skin, a long and silky coat, or requires medicated solutions, we have you covered. Our products are formulated to cleanse, hydrate, and soothe, leaving your dog's coat shiny and smelling fresh.\n\n#### Brushes and Combs\n\nRegular brushing and combing are essential for maintaining a healthy coat and reducing shedding. Our selection of brushes and combs is designed to cater to different coat types. From slicker brushes for long-haired breeds to deshedding tools for heavy shedders, we have the right grooming tools for you.\n\n#### Nail Clippers\n\nTrimming your dog's nails is a vital part of their grooming routine. Our nail clippers are designed for ease of use, ensuring a safe and stress-free experience for both you and your dog. Say goodbye to overgrown nails that can cause discomfort and potential injury\n\n#### Grooming Kits\n\nIf you're new to grooming or prefer an all-in-one solution, our grooming kits are a fantastic choice. These kits typically include a combination of essential grooming tools, making it easy to keep your dog looking their best. They are ideal for both beginners and experienced pet parents looking for convenience.\n\n## Specialty Products\n\nIn addition to our core grooming supplies, we offer specialty products to address specific needs. These may include tear stain removers, ear cleaners, and paw balms. Our specialty items are formulated to tackle common grooming challenges, ensuring your dog's comfort and well-being. Our team is dedicated to ensuring that you and your canine companion have the best shopping experience possible. We stand behind the quality of our products, and your satisfaction is our top priority.",
      "productCount": 13
    },
    {
      "id": "8",
      "name": "All products",
      "title": "Premium Dog Products",
      "path": "products",
      "description": "We understand that your furry friend deserves nothing but the best. Discover a delightful array of high-quality products designed to enhance your dog's comfort, happiness, and well-being",
      "overview": "From cozy beds to stylish apparel, interactive toys to nutritious treats, our curated collection offers a wide range of items to cater to your dog's every need. Each product is thoughtfully selected to ensure your canine companion experiences ultimate joy and care. Experience the joy of pampering your beloved companion with the finest dog products available. Our commitment to quality ensures that your dog receives the care they truly deserve. Explore our catalog now and elevate your dog's lifestyle to new heights of comfort and happiness!\n\n#### Comfortable Rest\n\nExplore our luxurious dog beds and cozy sleeping options that provide your pup with the perfect place to unwind after a day of play. Plush Bolster Bed for Small Breeds,<ins>Cozy Donut Cuddler Bed</ins> - our beds provide optimal support and comfort, ensuring your canine companion enjoys restful sleep\n\n#### Tail-Wagging Fashion\n\nDress your furry friend in style with our trendy dog apparel, from adorable sweaters to practical raincoats, making walks and outings a fashion statement. Waterproof raincoats, doggie bandanas in various prints, adorable dog bowties or reflective safety vests for night walks our clother collection combines fashion and function!\n\n#### Engaging Playtime\n\nChoose from an assortment of interactive toys that keep them entertained for hours on end.\n\n#### Grooming and Wellness\n\nDiscover grooming products that promote your dog's hygiene and well-being, from gentle shampoos to effective tick and flea solutions.\n\n#### Travel Essentials\n\nMake adventures with your dog stress-free with our travel-friendly accessories, including collapsible bowls, comfortable carriers, and more.\n\n#### Stylish Collars and Durable Leads\n\nEnsure your dog's safety and style during walks with our exquisite collection of collars and leads. Choose from a range of designs and materials that blend fashion and functionality seamlessly.",
      "productCount": 0
    },
    {
      "id": "9",
      "name": "Toys",
      "title": "toys title",
      "path": "toys",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Perfect toys for your dog's playtime enjoyment\n\nDogs are more than just pets; they are loyal companions and beloved members of our families. One of the best ways to show our furry friends love and care is through playtime. Dog toys are not just playthings; they're essential tools for keeping your dog mentally and physically stimulated. When choosing dog toys, always prioritize safety. Opt for toys made from non-toxic materials and avoid small parts that your dog could swallow. Supervise playtime, especially with new toys, to ensure your dog's safety.\n### Types of Dog Toys\n\n#### Fetch Toys\n\nPlaying with your dog strengthens the bond between you and your furry friend. Balls, frisbees, and sticks are perfect for a game of fetch. They encourage your dog to run and exercise, and the joy of retrieving brings a sense of accomplishment.\n\n#### Chew Toys\n\nRegular brushing and combing are essential for maintaining a healthy coat and reducing shedding. Our selection of brushes and combs is designed to cater to different coat types. From slicker brushes for long-haired breeds to deshedding tools for heavy shedders, we have the right grooming tools for you.\n\n#### Squeaky Toys\n\nSqueaky toys mimic the sound of prey, making them particularly exciting for many dogs. These toys emit playful squeaks when bitten or squeezed, providing entertainment and engagement during playtime.\n\n#### Plush Toys\n\nSoft and cuddly plush toys are great for comfort and companionship. Plush toys provide comfort and companionship to dogs of all ages. They are soft and cuddly, making them perfect for dogs that enjoy snuggling with a plush friend. Look for plush toys with reinforced seams for added durability. Keep in mind that some dogs may enjoy gently chewing on their plush toys, while others prefer to treat them as comfort objects using them as pillows during naptime.",
      "productCount": 13
    },
    {
      "id": "10",
      "name": "Leads&harnesses",
      "title": "leads title",
      "path": "leads&harnesses",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Make an Informed Choice about Right Dog Leash\n\nWhen it comes to walking your four-legged friend, selecting the right dog leash is crucial. The choice of leash can greatly impact both your and your dog's comfort, safety, and overall walking experience. In this guide, we'll delve into the different types of dog leashes to help you make an informed decision. Each type of dog leash has its own advantages and disadvantages. The key is to consider your dog's size, temperament, and your preferred walking environment when making your selection. Whichever leash you choose, always prioritize safety and ensure a secure connection between you and your beloved pet.\n\n#### Standard Dog Leash\n\nThe standard dog leash is the classic choice for many dog owners. It's typically made from nylon or leather and comes in various lengths, with 4 to 6 feet being the most common. Standard leashes offer excellent control, making them ideal for training and walking in crowded areas. They provide a solid connection between you and your four-legged friend.\n\n#### Retractable Dog Leash\n\nRetractable leashes are all about giving your dog more freedom to roam while maintaining control. They feature a retractable cord or tape that can extend and retract as your dog moves. This type is perfect for allowing your dog to explore a bit during walks, but they require responsible handling to prevent tangling and accidents.\n\n#### Adjustable-length Leash\n\nAn adjustable-length leash offers versatility by allowing you to change the length as needed. It typically features multiple D-rings or clasps along its length, enabling you to customize the leash's size for various situations. This is an excellent choice for dogs that require both close control and some freedom during their walk.\n\n#### Martingale Leash\n\nMartingale leashes combine a standard leash with a limited-slip collar. They offer gentle control over your dog's movements without choking or causing discomfort. Martingale leashes are commonly used for dogs that have a tendency to slip out of regular collars.\n\n#### Hands-Free Leash\n\nActive dog owners love hands-free leashes that allow them to jog, hike, or walk their dogs without holding onto a traditional leash. These leashes are typically worn around the waist or across the body, leaving your hands free for other activities.\n\n#### Chain Leash\n\nChain leashes are exceptionally durable and are often used for strong, large breeds. They provide a sturdy grip and can withstand a lot of wear and tear. However, they can be heavier and less comfortable to hold than nylon or leather leashes.\n\n#### Bungee Leash\n\nBungee leashes have an elastic section that absorbs shock and reduces the impact of sudden pulls or jolts from your dog. They are perfect for dogs that tend to be enthusiastic pullers and help prevent injury to both you and your pup.",
      "productCount": 13
    },
    {
      "id": "11",
      "name": "Furniture",
      "title": "furniture title",
      "path": "furniture",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Elevate Your Dog's Comfort with Stylish Dog Furniture\n\nYour dog deserves the best, not only in love and care but also in comfort and style. That's why we've curated a selection of exquisite dog furniture pieces that will transform your home into a haven of luxury for your beloved canine companion. Create a space that reflects your style and provides your furry friend with a comfortable retreat. Browse our collection today and discover how you can elevate your dog's living experience.\n\n#### Luxury Dog Beds\n\nOur dog beds come in various sizes and styles, from plush and cushioned to elevated and orthopedic. Give your dog a luxurious place to rest, ensuring they wake up refreshed and rejuvenated.\n\n#### Cozy Crates and Kennels\n\nA cozy crate can be your dog's sanctuary, providing them with a safe and secure space they can call their own. Explore our stylish crates and kennels that blend seamlessly with your home decor while giving your dog a comfortable retreat. Our crates are available in various sizes to accommodate dogs of all breeds.\n\n#### Indoor and Outdoor Furniture\n\nGive your dog the comfort and luxury they deserve with our range of dog furniture. Create a space that reflects your style and provides your furry friend with a comfortable retreat. Browse our collection today and discover how you can elevate your dog's living experience.\n\n### Quality and Durability\n\nOur dog furniture is crafted with the utmost care and attention to detail. We prioritize quality and durability to ensure that your investment in your dog's comfort lasts for years to come. Rest assured that our furniture is built to withstand the wear and tear of daily use. Many of our dog furniture pieces come with additional features such as storage compartments, removable and washable covers, and built-in pet bowls, enhancing their functionality.",
      "productCount": 13
    },
    {
      "id": "12",
      "name": "Collars",
      "title": "collars title",
      "path": "collars",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Why Choose a Quality Dog Collar?\n\nYour dog's collar is not just an accessory; it's a vital tool for their safety and identification.  We understand that choosing the right collar is essential for your dog's well-being. That's why we offer a wide selection and comprehensive guidance to help you make an informed choice. Remember that your dog's collar it's a reflection of your love and care for your beloved pet.\n\n### Choosing the Perfect Dog Collar: Tips and Advice\n\n#### 1.Measure for Fit\n\nProper fit is crucial for your dog's comfort and safety. Measure your dog's neck circumference accurately to select the right size. Most collars come with sizing charts to assist you in choosing the appropriate size.\n\n#### 2.Consider Your Dog's Activity Level\n\nDifferent dogs have different activity levels. If your dog is highly IN STOCK, a durable, adjustable, and secure collar is essential. For dogs with sensitive skin or neck issues, consider padded or cushioned collars for added comfort.\n\n#### 3.Reflect on Safety Features\n\nSafety should be a top priority. Opt for collars with reflective or LED features if you walk your dog during low-light hours. These collars enhance visibility, ensuring your pet is seen by others, which is especially important near roads.\n\n#### 4.Material Matters\n\nCollars come in various materials, including nylon, leather, and chain. Each material has its own set of pros and cons. Nylon is lightweight and easy to clean, while leather is durable and stylish. Chain collars may be suitable for training purposes, but use them with caution and seek professional guidance if necessary.\n\n#### 5.Personalization Options\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n#### 6.Regular Checkups\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n### Shop with Confidence\n\nAt Happy Tails, we are committed to providing you with the best selection of dog collars from top brands that prioritize quality and safety. Browse our catalog, read product descriptions, and make an informed choice for your beloved pet.\nChoosing the right dog collar is an important decision for any pet owner. With our range of options and these valuable tips, you can find a collar that keeps your furry friend both safe and stylish. Shop now and give your dog the comfort and security they deserve",
      "productCount": 13
    },
    {
      "id": "13",
      "name": "Clothing",
      "title": "clothing title",
      "path": "clothing",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Stylish Dog Clothes from Top Brands\nWelcome to the ultimate destination for discerning dog owners and their fashionable companions. Happy tails comprehensive catalog features a curated selection of dog clothes from renowned brands that are committed to quality, style, and comfort. Whether you're seeking cozy sweaters for those chilly evenings, rugged outdoor gear for adventurous outings, or the latest fashion trends for your stylish pooch, our catalog has it all. We understand that dogs have unique needs, and that's why we offer a wide range of styles and sizes to cater to every breed and personality.\n\n### How to Choose the Perfect Dog Clothes: A Guide for Pet Parents\n\n#### Consider Your Dog's Size and Breed\n\nOne size does not fit all when it comes to dog clothing. Different breeds have varying body shapes and sizes. Measure your dog's neck, chest, and length to ensure a proper fit. Many brands provide sizing charts to help you choose the right size, so be sure to refer to these guides when shopping.\n\n#### Think About the Season\n\nJust like humans, dogs have different clothing needs depending on the weather. In colder months, opt for insulating and warm clothes like sweaters, coats, and booties to keep your pup cozy during outdoor adventures. In warmer weather, lightweight and breathable options like T-shirts and cooling vests can help your dog stay comfortable.\n\n#### Consider Your Dog's Activity Level\n\nIf your dog is an active one, choose clothes that allow for easy movement. Look for designs with adjustable closures and elastic bands that provide flexibility without compromising fit. For less active dogs or those recovering from surgery, consider garments that are easy to put on and take off.\n\n#### Prioritize Safety and Comfort\n\nEnsure that the clothes you choose don't have any small parts that your dog could chew on or swallow. Opt for materials that are soft, non-restrictive, and hypoallergenic to avoid irritation. Always check for any tags or seams that could cause discomfort.\n\n#### Style and Aesthetics\n\nWhile functionality is crucial, style can also be a factor. Some pet parents enjoy dressing up their dogs in fun and fashionable outfits. Consider your dog's personality and your own style preferences when selecting clothes. From classic designs to trendy fashion pieces, there's something for every taste.\n\n### Elevate Your Dog's Style\nChoosing dog clothes can be a fun and rewarding experience when you keep your pet's comfort and safety in mind. By following these guidelines, you can make sure your furry friend not only looks great but also feels great in their new attire. With our user-friendly online store, shopping for your furry friend has never been easier. Our secure checkout process and reliable shipping ensure that your dog's new outfits will be at your doorstep in no time.",
      "productCount": 13
    },
    {
      "id": "14",
      "name": "Care",
      "title": "care title",
      "path": "care",
      "description": "Explore our exclusive collection of high-quality dog clothes designed to keep your furry friend both stylish and comfortable. Find the perfect fit for your dog and elevate their wardrobe today.",
      "overview": "## Give your dog the royal treatment with our grooming essentials\n\n#### Shampoos and Conditioners\n\nOur range of dog shampoos and conditioners includes options for various coat types and specific needs. Whether your dog has sensitive skin, a long and silky coat, or requires medicated solutions, we have you covered. Our products are formulated to cleanse, hydrate, and soothe, leaving your dog's coat shiny and smelling fresh.\n\n#### Brushes and Combs\n\nRegular brushing and combing are essential for maintaining a healthy coat and reducing shedding. Our selection of brushes and combs is designed to cater to different coat types. From slicker brushes for long-haired breeds to deshedding tools for heavy shedders, we have the right grooming tools for you.\n\n#### Nail Clippers\n\nTrimming your dog's nails is a vital part of their grooming routine. Our nail clippers are designed for ease of use, ensuring a safe and stress-free experience for both you and your dog. Say goodbye to overgrown nails that can cause discomfort and potential injury\n\n#### Grooming Kits\n\nIf you're new to grooming or prefer an all-in-one solution, our grooming kits are a fantastic choice. These kits typically include a combination of essential grooming tools, making it easy to keep your dog looking their best. They are ideal for both beginners and experienced pet parents looking for convenience.\n\n## Specialty Products\n\nIn addition to our core grooming supplies, we offer specialty products to address specific needs. These may include tear stain removers, ear cleaners, and paw balms. Our specialty items are formulated to tackle common grooming challenges, ensuring your dog's comfort and well-being. Our team is dedicated to ensuring that you and your canine companion have the best shopping experience possible. We stand behind the quality of our products, and your satisfaction is our top priority.",
      "productCount": 13
    }
  ],
  "pageable": "INSTANCE",
  "totalPages": 1,
  "totalElements": 14,
  "last": true,
  "size": 14,
  "number": 0,
  "sort": {
    "empty": true,
    "unsorted": true,
    "sorted": false
  },
  "numberOfElements": 14,
  "first": true,
  "empty": false
}